aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pwm.h
/**
 * \file
 *
 * \brief Component description for PWM
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#ifndef _SAME70_PWM_COMPONENT_H_
#define _SAME70_PWM_COMPONENT_H_
#define _SAME70_PWM_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAME70_PWM Pulse Width Modulation Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PWM */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define PWM_6343                       /**< (PWM) Module ID */
#define REV_PWM U                      /**< (PWM) Module revision */

/* -------- PWM_CMR : (PWM Offset: 0x00) (R/W 32) PWM Channel Mode Register (ch_num = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CPRE:4;                    /**< bit:   0..3  Channel Pre-scaler                       */
    uint32_t :4;                        /**< bit:   4..7  Reserved */
    uint32_t CALG:1;                    /**< bit:      8  Channel Alignment                        */
    uint32_t CPOL:1;                    /**< bit:      9  Channel Polarity                         */
    uint32_t CES:1;                     /**< bit:     10  Counter Event Selection                  */
    uint32_t UPDS:1;                    /**< bit:     11  Update Selection                         */
    uint32_t DPOLI:1;                   /**< bit:     12  Disabled Polarity Inverted               */
    uint32_t TCTS:1;                    /**< bit:     13  Timer Counter Trigger Selection          */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t DTE:1;                     /**< bit:     16  Dead-Time Generator Enable               */
    uint32_t DTHI:1;                    /**< bit:     17  Dead-Time PWMHx Output Inverted          */
    uint32_t DTLI:1;                    /**< bit:     18  Dead-Time PWMLx Output Inverted          */
    uint32_t PPM:1;                     /**< bit:     19  Push-Pull Mode                           */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMR_OFFSET                      (0x00)                                        /**<  (PWM_CMR) PWM Channel Mode Register (ch_num = 0)  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PWM_CMR_CPRE_Pos                    0                                              /**< (PWM_CMR) Channel Pre-scaler Position */
#define PWM_CMR_CPRE_Msk                    (0xFU << PWM_CMR_CPRE_Pos)                     /**< (PWM_CMR) Channel Pre-scaler Mask */
#define PWM_CMR_CPRE(value)                 (PWM_CMR_CPRE_Msk & ((value) << PWM_CMR_CPRE_Pos))
#define   PWM_CMR_CPRE_MCK_Val              (0x0U)                                         /**< (PWM_CMR) Peripheral clock  */
#define   PWM_CMR_CPRE_MCK_DIV_2_Val        (0x1U)                                         /**< (PWM_CMR) Peripheral clock/2  */
#define   PWM_CMR_CPRE_MCK_DIV_4_Val        (0x2U)                                         /**< (PWM_CMR) Peripheral clock/4  */
#define   PWM_CMR_CPRE_MCK_DIV_8_Val        (0x3U)                                         /**< (PWM_CMR) Peripheral clock/8  */
#define   PWM_CMR_CPRE_MCK_DIV_16_Val       (0x4U)                                         /**< (PWM_CMR) Peripheral clock/16  */
#define   PWM_CMR_CPRE_MCK_DIV_32_Val       (0x5U)                                         /**< (PWM_CMR) Peripheral clock/32  */
#define   PWM_CMR_CPRE_MCK_DIV_64_Val       (0x6U)                                         /**< (PWM_CMR) Peripheral clock/64  */
#define   PWM_CMR_CPRE_MCK_DIV_128_Val      (0x7U)                                         /**< (PWM_CMR) Peripheral clock/128  */
#define   PWM_CMR_CPRE_MCK_DIV_256_Val      (0x8U)                                         /**< (PWM_CMR) Peripheral clock/256  */
#define   PWM_CMR_CPRE_MCK_DIV_512_Val      (0x9U)                                         /**< (PWM_CMR) Peripheral clock/512  */
#define   PWM_CMR_CPRE_MCK_DIV_1024_Val     (0xAU)                                         /**< (PWM_CMR) Peripheral clock/1024  */
#define   PWM_CMR_CPRE_CLKA_Val             (0xBU)                                         /**< (PWM_CMR) Clock A  */
#define   PWM_CMR_CPRE_CLKB_Val             (0xCU)                                         /**< (PWM_CMR) Clock B  */
#define PWM_CMR_CPRE_MCK                    (PWM_CMR_CPRE_MCK_Val << PWM_CMR_CPRE_Pos)     /**< (PWM_CMR) Peripheral clock Position  */
#define PWM_CMR_CPRE_MCK_DIV_2              (PWM_CMR_CPRE_MCK_DIV_2_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/2 Position  */
#define PWM_CMR_CPRE_MCK_DIV_4              (PWM_CMR_CPRE_MCK_DIV_4_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/4 Position  */
#define PWM_CMR_CPRE_MCK_DIV_8              (PWM_CMR_CPRE_MCK_DIV_8_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/8 Position  */
#define PWM_CMR_CPRE_MCK_DIV_16             (PWM_CMR_CPRE_MCK_DIV_16_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/16 Position  */
#define PWM_CMR_CPRE_MCK_DIV_32             (PWM_CMR_CPRE_MCK_DIV_32_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/32 Position  */
#define PWM_CMR_CPRE_MCK_DIV_64             (PWM_CMR_CPRE_MCK_DIV_64_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/64 Position  */
#define PWM_CMR_CPRE_MCK_DIV_128            (PWM_CMR_CPRE_MCK_DIV_128_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/128 Position  */
#define PWM_CMR_CPRE_MCK_DIV_256            (PWM_CMR_CPRE_MCK_DIV_256_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/256 Position  */
#define PWM_CMR_CPRE_MCK_DIV_512            (PWM_CMR_CPRE_MCK_DIV_512_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/512 Position  */
#define PWM_CMR_CPRE_MCK_DIV_1024           (PWM_CMR_CPRE_MCK_DIV_1024_Val << PWM_CMR_CPRE_Pos)  /**< (PWM_CMR) Peripheral clock/1024 Position  */
#define PWM_CMR_CPRE_CLKA                   (PWM_CMR_CPRE_CLKA_Val << PWM_CMR_CPRE_Pos)    /**< (PWM_CMR) Clock A Position  */
#define PWM_CMR_CPRE_CLKB                   (PWM_CMR_CPRE_CLKB_Val << PWM_CMR_CPRE_Pos)    /**< (PWM_CMR) Clock B Position  */
#define PWM_CMR_CALG_Pos                    8                                              /**< (PWM_CMR) Channel Alignment Position */
#define PWM_CMR_CALG_Msk                    (0x1U << PWM_CMR_CALG_Pos)                     /**< (PWM_CMR) Channel Alignment Mask */
#define PWM_CMR_CALG                        PWM_CMR_CALG_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_CALG_Msk instead */
#define PWM_CMR_CPOL_Pos                    9                                              /**< (PWM_CMR) Channel Polarity Position */
#define PWM_CMR_CPOL_Msk                    (0x1U << PWM_CMR_CPOL_Pos)                     /**< (PWM_CMR) Channel Polarity Mask */
#define PWM_CMR_CPOL                        PWM_CMR_CPOL_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_CPOL_Msk instead */
#define PWM_CMR_CES_Pos                     10                                             /**< (PWM_CMR) Counter Event Selection Position */
#define PWM_CMR_CES_Msk                     (0x1U << PWM_CMR_CES_Pos)                      /**< (PWM_CMR) Counter Event Selection Mask */
#define PWM_CMR_CES                         PWM_CMR_CES_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_CES_Msk instead */
#define PWM_CMR_UPDS_Pos                    11                                             /**< (PWM_CMR) Update Selection Position */
#define PWM_CMR_UPDS_Msk                    (0x1U << PWM_CMR_UPDS_Pos)                     /**< (PWM_CMR) Update Selection Mask */
#define PWM_CMR_UPDS                        PWM_CMR_UPDS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_UPDS_Msk instead */
#define PWM_CMR_DPOLI_Pos                   12                                             /**< (PWM_CMR) Disabled Polarity Inverted Position */
#define PWM_CMR_DPOLI_Msk                   (0x1U << PWM_CMR_DPOLI_Pos)                    /**< (PWM_CMR) Disabled Polarity Inverted Mask */
#define PWM_CMR_DPOLI                       PWM_CMR_DPOLI_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_DPOLI_Msk instead */
#define PWM_CMR_TCTS_Pos                    13                                             /**< (PWM_CMR) Timer Counter Trigger Selection Position */
#define PWM_CMR_TCTS_Msk                    (0x1U << PWM_CMR_TCTS_Pos)                     /**< (PWM_CMR) Timer Counter Trigger Selection Mask */
#define PWM_CMR_TCTS                        PWM_CMR_TCTS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_TCTS_Msk instead */
#define PWM_CMR_DTE_Pos                     16                                             /**< (PWM_CMR) Dead-Time Generator Enable Position */
#define PWM_CMR_DTE_Msk                     (0x1U << PWM_CMR_DTE_Pos)                      /**< (PWM_CMR) Dead-Time Generator Enable Mask */
#define PWM_CMR_DTE                         PWM_CMR_DTE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_DTE_Msk instead */
#define PWM_CMR_DTHI_Pos                    17                                             /**< (PWM_CMR) Dead-Time PWMHx Output Inverted Position */
#define PWM_CMR_DTHI_Msk                    (0x1U << PWM_CMR_DTHI_Pos)                     /**< (PWM_CMR) Dead-Time PWMHx Output Inverted Mask */
#define PWM_CMR_DTHI                        PWM_CMR_DTHI_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_DTHI_Msk instead */
#define PWM_CMR_DTLI_Pos                    18                                             /**< (PWM_CMR) Dead-Time PWMLx Output Inverted Position */
#define PWM_CMR_DTLI_Msk                    (0x1U << PWM_CMR_DTLI_Pos)                     /**< (PWM_CMR) Dead-Time PWMLx Output Inverted Mask */
#define PWM_CMR_DTLI                        PWM_CMR_DTLI_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_DTLI_Msk instead */
#define PWM_CMR_PPM_Pos                     19                                             /**< (PWM_CMR) Push-Pull Mode Position */
#define PWM_CMR_PPM_Msk                     (0x1U << PWM_CMR_PPM_Pos)                      /**< (PWM_CMR) Push-Pull Mode Mask */
#define PWM_CMR_PPM                         PWM_CMR_PPM_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMR_PPM_Msk instead */
#define PWM_CMR_MASK                        (0xF3F0FU)                                     /**< \deprecated (PWM_CMR) Register MASK  (Use PWM_CMR_Msk instead)  */
#define PWM_CMR_Msk                         (0xF3F0FU)                                     /**< (PWM_CMR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- PWM_CDTY : (PWM Offset: 0x04) (R/W 32) PWM Channel Duty Cycle Register (ch_num = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CDTY:24;                   /**< bit:  0..23  Channel Duty-Cycle                       */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CDTY_Type;
