aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pwm.h
/* -------- PWM_CMPVUPD : (PWM Offset: 0x04) (/W 32) PWM Comparison 0 Value Update Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CVUPD:24;                  /**< bit:  0..23  Comparison x Value Update                */
    uint32_t CVMUPD:1;                  /**< bit:     24  Comparison x Value Mode Update           */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMPVUPD_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMPVUPD_OFFSET                  (0x04)                                        /**<  (PWM_CMPVUPD) PWM Comparison 0 Value Update Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PWM_CMPVUPD_CVUPD_Pos               0                                              /**< (PWM_CMPVUPD) Comparison x Value Update Position */
#define PWM_CMPVUPD_CVUPD_Msk               (0xFFFFFFU << PWM_CMPVUPD_CVUPD_Pos)           /**< (PWM_CMPVUPD) Comparison x Value Update Mask */
#define PWM_CMPVUPD_CVUPD(value)            (PWM_CMPVUPD_CVUPD_Msk & ((value) << PWM_CMPVUPD_CVUPD_Pos))
#define PWM_CMPVUPD_CVMUPD_Pos              24                                             /**< (PWM_CMPVUPD) Comparison x Value Mode Update Position */
#define PWM_CMPVUPD_CVMUPD_Msk              (0x1U << PWM_CMPVUPD_CVMUPD_Pos)               /**< (PWM_CMPVUPD) Comparison x Value Mode Update Mask */
#define PWM_CMPVUPD_CVMUPD                  PWM_CMPVUPD_CVMUPD_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMPVUPD_CVMUPD_Msk instead */
#define PWM_CMPVUPD_MASK                    (0x1FFFFFFU)                                   /**< \deprecated (PWM_CMPVUPD) Register MASK  (Use PWM_CMPVUPD_Msk instead)  */
#define PWM_CMPVUPD_Msk                     (0x1FFFFFFU)                                   /**< (PWM_CMPVUPD) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- PWM_CMPM : (PWM Offset: 0x08) (R/W 32) PWM Comparison 0 Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CEN:1;                     /**< bit:      0  Comparison x Enable                      */
    uint32_t :3;                        /**< bit:   1..3  Reserved */
    uint32_t CTR:4;                     /**< bit:   4..7  Comparison x Trigger                     */
    uint32_t CPR:4;                     /**< bit:  8..11  Comparison x Period                      */
    uint32_t CPRCNT:4;                  /**< bit: 12..15  Comparison x Period Counter              */
    uint32_t CUPR:4;                    /**< bit: 16..19  Comparison x Update Period               */
    uint32_t CUPRCNT:4;                 /**< bit: 20..23  Comparison x Update Period Counter       */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMPM_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMPM_OFFSET                     (0x08)                                        /**<  (PWM_CMPM) PWM Comparison 0 Mode Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PWM_CMPM_CEN_Pos                    0                                              /**< (PWM_CMPM) Comparison x Enable Position */
#define PWM_CMPM_CEN_Msk                    (0x1U << PWM_CMPM_CEN_Pos)                     /**< (PWM_CMPM) Comparison x Enable Mask */
#define PWM_CMPM_CEN                        PWM_CMPM_CEN_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMPM_CEN_Msk instead */
#define PWM_CMPM_CTR_Pos                    4                                              /**< (PWM_CMPM) Comparison x Trigger Position */
#define PWM_CMPM_CTR_Msk                    (0xFU << PWM_CMPM_CTR_Pos)                     /**< (PWM_CMPM) Comparison x Trigger Mask */
#define PWM_CMPM_CTR(value)                 (PWM_CMPM_CTR_Msk & ((value) << PWM_CMPM_CTR_Pos))
#define PWM_CMPM_CPR_Pos                    8                                              /**< (PWM_CMPM) Comparison x Period Position */
#define PWM_CMPM_CPR_Msk                    (0xFU << PWM_CMPM_CPR_Pos)                     /**< (PWM_CMPM) Comparison x Period Mask */
#define PWM_CMPM_CPR(value)                 (PWM_CMPM_CPR_Msk & ((value) << PWM_CMPM_CPR_Pos))
#define PWM_CMPM_CPRCNT_Pos                 12                                             /**< (PWM_CMPM) Comparison x Period Counter Position */
#define PWM_CMPM_CPRCNT_Msk                 (0xFU << PWM_CMPM_CPRCNT_Pos)                  /**< (PWM_CMPM) Comparison x Period Counter Mask */
#define PWM_CMPM_CPRCNT(value)              (PWM_CMPM_CPRCNT_Msk & ((value) << PWM_CMPM_CPRCNT_Pos))
#define PWM_CMPM_CUPR_Pos                   16                                             /**< (PWM_CMPM) Comparison x Update Period Position */
#define PWM_CMPM_CUPR_Msk                   (0xFU << PWM_CMPM_CUPR_Pos)                    /**< (PWM_CMPM) Comparison x Update Period Mask */
#define PWM_CMPM_CUPR(value)                (PWM_CMPM_CUPR_Msk & ((value) << PWM_CMPM_CUPR_Pos))
#define PWM_CMPM_CUPRCNT_Pos                20                                             /**< (PWM_CMPM) Comparison x Update Period Counter Position */
#define PWM_CMPM_CUPRCNT_Msk                (0xFU << PWM_CMPM_CUPRCNT_Pos)                 /**< (PWM_CMPM) Comparison x Update Period Counter Mask */
#define PWM_CMPM_CUPRCNT(value)             (PWM_CMPM_CUPRCNT_Msk & ((value) << PWM_CMPM_CUPRCNT_Pos))
#define PWM_CMPM_MASK                       (0xFFFFF1U)                                    /**< \deprecated (PWM_CMPM) Register MASK  (Use PWM_CMPM_Msk instead)  */
#define PWM_CMPM_Msk                        (0xFFFFF1U)                                    /**< (PWM_CMPM) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- PWM_CMPMUPD : (PWM Offset: 0x0c) (/W 32) PWM Comparison 0 Mode Update Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CENUPD:1;                  /**< bit:      0  Comparison x Enable Update               */
    uint32_t :3;                        /**< bit:   1..3  Reserved */
    uint32_t CTRUPD:4;                  /**< bit:   4..7  Comparison x Trigger Update              */
    uint32_t CPRUPD:4;                  /**< bit:  8..11  Comparison x Period Update               */
    uint32_t :4;                        /**< bit: 12..15  Reserved */
    uint32_t CUPRUPD:4;                 /**< bit: 16..19  Comparison x Update Period Update        */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMPMUPD_Type;
