aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMPMUPD_OFFSET                  (0x0C)                                        /**<  (PWM_CMPMUPD) PWM Comparison 0 Mode Update Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PWM_CMPMUPD_CENUPD_Pos              0                                              /**< (PWM_CMPMUPD) Comparison x Enable Update Position */
#define PWM_CMPMUPD_CENUPD_Msk              (0x1U << PWM_CMPMUPD_CENUPD_Pos)               /**< (PWM_CMPMUPD) Comparison x Enable Update Mask */
#define PWM_CMPMUPD_CENUPD                  PWM_CMPMUPD_CENUPD_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMPMUPD_CENUPD_Msk instead */
#define PWM_CMPMUPD_CTRUPD_Pos              4                                              /**< (PWM_CMPMUPD) Comparison x Trigger Update Position */
#define PWM_CMPMUPD_CTRUPD_Msk              (0xFU << PWM_CMPMUPD_CTRUPD_Pos)               /**< (PWM_CMPMUPD) Comparison x Trigger Update Mask */
#define PWM_CMPMUPD_CTRUPD(value)           (PWM_CMPMUPD_CTRUPD_Msk & ((value) << PWM_CMPMUPD_CTRUPD_Pos))
#define PWM_CMPMUPD_CPRUPD_Pos              8                                              /**< (PWM_CMPMUPD) Comparison x Period Update Position */
#define PWM_CMPMUPD_CPRUPD_Msk              (0xFU << PWM_CMPMUPD_CPRUPD_Pos)               /**< (PWM_CMPMUPD) Comparison x Period Update Mask */
#define PWM_CMPMUPD_CPRUPD(value)           (PWM_CMPMUPD_CPRUPD_Msk & ((value) << PWM_CMPMUPD_CPRUPD_Pos))
#define PWM_CMPMUPD_CUPRUPD_Pos             16                                             /**< (PWM_CMPMUPD) Comparison x Update Period Update Position */
#define PWM_CMPMUPD_CUPRUPD_Msk             (0xFU << PWM_CMPMUPD_CUPRUPD_Pos)              /**< (PWM_CMPMUPD) Comparison x Update Period Update Mask */
#define PWM_CMPMUPD_CUPRUPD(value)          (PWM_CMPMUPD_CUPRUPD_Msk & ((value) << PWM_CMPMUPD_CUPRUPD_Pos))
#define PWM_CMPMUPD_MASK                    (0xF0FF1U)                                     /**< \deprecated (PWM_CMPMUPD) Register MASK  (Use PWM_CMPMUPD_Msk instead)  */
#define PWM_CMPMUPD_Msk                     (0xF0FF1U)                                     /**< (PWM_CMPMUPD) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- PWM_CLK : (PWM Offset: 0x00) (R/W 32) PWM Clock Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DIVA:8;                    /**< bit:   0..7  CLKA Divide Factor                       */
    uint32_t PREA:4;                    /**< bit:  8..11  CLKA Source Clock Selection              */
    uint32_t :4;                        /**< bit: 12..15  Reserved */
    uint32_t DIVB:8;                    /**< bit: 16..23  CLKB Divide Factor                       */
    uint32_t PREB:4;                    /**< bit: 24..27  CLKB Source Clock Selection              */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CLK_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CLK_OFFSET                      (0x00)                                        /**<  (PWM_CLK) PWM Clock Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PWM_CLK_DIVA_Pos                    0                                              /**< (PWM_CLK) CLKA Divide Factor Position */
#define PWM_CLK_DIVA_Msk                    (0xFFU << PWM_CLK_DIVA_Pos)                    /**< (PWM_CLK) CLKA Divide Factor Mask */
#define PWM_CLK_DIVA(value)                 (PWM_CLK_DIVA_Msk & ((value) << PWM_CLK_DIVA_Pos))
#define   PWM_CLK_DIVA_CLKA_POFF_Val        (0x0U)                                         /**< (PWM_CLK) CLKA clock is turned off  */
#define   PWM_CLK_DIVA_PREA_Val             (0x1U)                                         /**< (PWM_CLK) CLKA clock is clock selected by PREA  */
#define PWM_CLK_DIVA_CLKA_POFF              (PWM_CLK_DIVA_CLKA_POFF_Val << PWM_CLK_DIVA_Pos)  /**< (PWM_CLK) CLKA clock is turned off Position  */
#define PWM_CLK_DIVA_PREA                   (PWM_CLK_DIVA_PREA_Val << PWM_CLK_DIVA_Pos)    /**< (PWM_CLK) CLKA clock is clock selected by PREA Position  */
#define PWM_CLK_PREA_Pos                    8                                              /**< (PWM_CLK) CLKA Source Clock Selection Position */
#define PWM_CLK_PREA_Msk                    (0xFU << PWM_CLK_PREA_Pos)                     /**< (PWM_CLK) CLKA Source Clock Selection Mask */
#define PWM_CLK_PREA(value)                 (PWM_CLK_PREA_Msk & ((value) << PWM_CLK_PREA_Pos))
#define   PWM_CLK_PREA_CLK_Val              (0x0U)                                         /**< (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREA_CLK_DIV2_Val         (0x1U)                                         /**< (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREA_CLK_DIV4_Val         (0x2U)                                         /**< (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREA_CLK_DIV8_Val         (0x3U)                                         /**< (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREA_CLK_DIV16_Val        (0x4U)                                         /**< (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREA_CLK_DIV32_Val        (0x5U)                                         /**< (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREA_CLK_DIV64_Val        (0x6U)                                         /**< (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREA_CLK_DIV128_Val       (0x7U)                                         /**< (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREA_CLK_DIV256_Val       (0x8U)                                         /**< (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREA_CLK_DIV512_Val       (0x9U)                                         /**< (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREA_CLK_DIV1024_Val      (0xAU)                                         /**< (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREA_CLK                    (PWM_CLK_PREA_CLK_Val << PWM_CLK_PREA_Pos)     /**< (PWM_CLK) Peripheral clock Position  */
#define PWM_CLK_PREA_CLK_DIV2               (PWM_CLK_PREA_CLK_DIV2_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/2 Position  */
#define PWM_CLK_PREA_CLK_DIV4               (PWM_CLK_PREA_CLK_DIV4_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/4 Position  */
#define PWM_CLK_PREA_CLK_DIV8               (PWM_CLK_PREA_CLK_DIV8_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/8 Position  */
#define PWM_CLK_PREA_CLK_DIV16              (PWM_CLK_PREA_CLK_DIV16_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/16 Position  */
#define PWM_CLK_PREA_CLK_DIV32              (PWM_CLK_PREA_CLK_DIV32_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/32 Position  */
#define PWM_CLK_PREA_CLK_DIV64              (PWM_CLK_PREA_CLK_DIV64_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/64 Position  */
#define PWM_CLK_PREA_CLK_DIV128             (PWM_CLK_PREA_CLK_DIV128_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/128 Position  */
#define PWM_CLK_PREA_CLK_DIV256             (PWM_CLK_PREA_CLK_DIV256_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/256 Position  */
#define PWM_CLK_PREA_CLK_DIV512             (PWM_CLK_PREA_CLK_DIV512_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/512 Position  */
#define PWM_CLK_PREA_CLK_DIV1024            (PWM_CLK_PREA_CLK_DIV1024_Val << PWM_CLK_PREA_Pos)  /**< (PWM_CLK) Peripheral clock/1024 Position  */
#define PWM_CLK_DIVB_Pos                    16                                             /**< (PWM_CLK) CLKB Divide Factor Position */
#define PWM_CLK_DIVB_Msk                    (0xFFU << PWM_CLK_DIVB_Pos)                    /**< (PWM_CLK) CLKB Divide Factor Mask */
#define PWM_CLK_DIVB(value)                 (PWM_CLK_DIVB_Msk & ((value) << PWM_CLK_DIVB_Pos))
#define   PWM_CLK_DIVB_CLKB_POFF_Val        (0x0U)                                         /**< (PWM_CLK) CLKB clock is turned off  */
#define   PWM_CLK_DIVB_PREB_Val             (0x1U)                                         /**< (PWM_CLK) CLKB clock is clock selected by PREB  */
#define PWM_CLK_DIVB_CLKB_POFF              (PWM_CLK_DIVB_CLKB_POFF_Val << PWM_CLK_DIVB_Pos)  /**< (PWM_CLK) CLKB clock is turned off Position  */
#define PWM_CLK_DIVB_PREB                   (PWM_CLK_DIVB_PREB_Val << PWM_CLK_DIVB_Pos)    /**< (PWM_CLK) CLKB clock is clock selected by PREB Position  */
#define PWM_CLK_PREB_Pos                    24                                             /**< (PWM_CLK) CLKB Source Clock Selection Position */
#define PWM_CLK_PREB_Msk                    (0xFU << PWM_CLK_PREB_Pos)                     /**< (PWM_CLK) CLKB Source Clock Selection Mask */
#define PWM_CLK_PREB(value)                 (PWM_CLK_PREB_Msk & ((value) << PWM_CLK_PREB_Pos))
#define   PWM_CLK_PREB_CLK_Val              (0x0U)                                         /**< (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREB_CLK_DIV2_Val         (0x1U)                                         /**< (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREB_CLK_DIV4_Val         (0x2U)                                         /**< (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREB_CLK_DIV8_Val         (0x3U)                                         /**< (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREB_CLK_DIV16_Val        (0x4U)                                         /**< (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREB_CLK_DIV32_Val        (0x5U)                                         /**< (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREB_CLK_DIV64_Val        (0x6U)                                         /**< (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREB_CLK_DIV128_Val       (0x7U)                                         /**< (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREB_CLK_DIV256_Val       (0x8U)                                         /**< (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREB_CLK_DIV512_Val       (0x9U)                                         /**< (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREB_CLK_DIV1024_Val      (0xAU)                                         /**< (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREB_CLK                    (PWM_CLK_PREB_CLK_Val << PWM_CLK_PREB_Pos)     /**< (PWM_CLK) Peripheral clock Position  */
#define PWM_CLK_PREB_CLK_DIV2               (PWM_CLK_PREB_CLK_DIV2_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/2 Position  */
#define PWM_CLK_PREB_CLK_DIV4               (PWM_CLK_PREB_CLK_DIV4_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/4 Position  */
#define PWM_CLK_PREB_CLK_DIV8               (PWM_CLK_PREB_CLK_DIV8_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/8 Position  */
#define PWM_CLK_PREB_CLK_DIV16              (PWM_CLK_PREB_CLK_DIV16_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/16 Position  */
#define PWM_CLK_PREB_CLK_DIV32              (PWM_CLK_PREB_CLK_DIV32_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/32 Position  */
#define PWM_CLK_PREB_CLK_DIV64              (PWM_CLK_PREB_CLK_DIV64_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/64 Position  */
#define PWM_CLK_PREB_CLK_DIV128             (PWM_CLK_PREB_CLK_DIV128_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/128 Position  */
#define PWM_CLK_PREB_CLK_DIV256             (PWM_CLK_PREB_CLK_DIV256_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/256 Position  */
#define PWM_CLK_PREB_CLK_DIV512             (PWM_CLK_PREB_CLK_DIV512_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/512 Position  */
#define PWM_CLK_PREB_CLK_DIV1024            (PWM_CLK_PREB_CLK_DIV1024_Val << PWM_CLK_PREB_Pos)  /**< (PWM_CLK) Peripheral clock/1024 Position  */
#define PWM_CLK_MASK                        (0xFFF0FFFU)                                   /**< \deprecated (PWM_CLK) Register MASK  (Use PWM_CLK_Msk instead)  */
#define PWM_CLK_Msk                         (0xFFF0FFFU)                                   /**< (PWM_CLK) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


