aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_LEBR2_OFFSET                    (0x450)                                       /**<  (PWM_LEBR2) PWM Leading-Edge Blanking Register (trg_num = 2)  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PWM_LEBR2_LEBDELAY_Pos              0                                              /**< (PWM_LEBR2) Leading-Edge Blanking Delay for TRGINx Position */
#define PWM_LEBR2_LEBDELAY_Msk              (0x7FU << PWM_LEBR2_LEBDELAY_Pos)              /**< (PWM_LEBR2) Leading-Edge Blanking Delay for TRGINx Mask */
#define PWM_LEBR2_LEBDELAY(value)           (PWM_LEBR2_LEBDELAY_Msk & ((value) << PWM_LEBR2_LEBDELAY_Pos))
#define PWM_LEBR2_PWMLFEN_Pos               16                                             /**< (PWM_LEBR2) PWML Falling Edge Enable Position */
#define PWM_LEBR2_PWMLFEN_Msk               (0x1U << PWM_LEBR2_PWMLFEN_Pos)                /**< (PWM_LEBR2) PWML Falling Edge Enable Mask */
#define PWM_LEBR2_PWMLFEN                   PWM_LEBR2_PWMLFEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR2_PWMLFEN_Msk instead */
#define PWM_LEBR2_PWMLREN_Pos               17                                             /**< (PWM_LEBR2) PWML Rising Edge Enable Position */
#define PWM_LEBR2_PWMLREN_Msk               (0x1U << PWM_LEBR2_PWMLREN_Pos)                /**< (PWM_LEBR2) PWML Rising Edge Enable Mask */
#define PWM_LEBR2_PWMLREN                   PWM_LEBR2_PWMLREN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR2_PWMLREN_Msk instead */
#define PWM_LEBR2_PWMHFEN_Pos               18                                             /**< (PWM_LEBR2) PWMH Falling Edge Enable Position */
#define PWM_LEBR2_PWMHFEN_Msk               (0x1U << PWM_LEBR2_PWMHFEN_Pos)                /**< (PWM_LEBR2) PWMH Falling Edge Enable Mask */
#define PWM_LEBR2_PWMHFEN                   PWM_LEBR2_PWMHFEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR2_PWMHFEN_Msk instead */
#define PWM_LEBR2_PWMHREN_Pos               19                                             /**< (PWM_LEBR2) PWMH Rising Edge Enable Position */
#define PWM_LEBR2_PWMHREN_Msk               (0x1U << PWM_LEBR2_PWMHREN_Pos)                /**< (PWM_LEBR2) PWMH Rising Edge Enable Mask */
#define PWM_LEBR2_PWMHREN                   PWM_LEBR2_PWMHREN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR2_PWMHREN_Msk instead */
#define PWM_LEBR2_MASK                      (0xF007FU)                                     /**< \deprecated (PWM_LEBR2) Register MASK  (Use PWM_LEBR2_Msk instead)  */
#define PWM_LEBR2_Msk                       (0xF007FU)                                     /**< (PWM_LEBR2) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- PWM_CMUPD3 : (PWM Offset: 0x460) (/W 32) PWM Channel Mode Update Register (ch_num = 3) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :9;                        /**< bit:   0..8  Reserved */
    uint32_t CPOLUP:1;                  /**< bit:      9  Channel Polarity Update                  */
    uint32_t :3;                        /**< bit: 10..12  Reserved */
    uint32_t CPOLINVUP:1;               /**< bit:     13  Channel Polarity Inversion Update        */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMUPD3_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMUPD3_OFFSET                   (0x460)                                       /**<  (PWM_CMUPD3) PWM Channel Mode Update Register (ch_num = 3)  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PWM_CMUPD3_CPOLUP_Pos               9                                              /**< (PWM_CMUPD3) Channel Polarity Update Position */
#define PWM_CMUPD3_CPOLUP_Msk               (0x1U << PWM_CMUPD3_CPOLUP_Pos)                /**< (PWM_CMUPD3) Channel Polarity Update Mask */
#define PWM_CMUPD3_CPOLUP                   PWM_CMUPD3_CPOLUP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD3_CPOLUP_Msk instead */
#define PWM_CMUPD3_CPOLINVUP_Pos            13                                             /**< (PWM_CMUPD3) Channel Polarity Inversion Update Position */
#define PWM_CMUPD3_CPOLINVUP_Msk            (0x1U << PWM_CMUPD3_CPOLINVUP_Pos)             /**< (PWM_CMUPD3) Channel Polarity Inversion Update Mask */
#define PWM_CMUPD3_CPOLINVUP                PWM_CMUPD3_CPOLINVUP_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD3_CPOLINVUP_Msk instead */
#define PWM_CMUPD3_MASK                     (0x2200U)                                      /**< \deprecated (PWM_CMUPD3) Register MASK  (Use PWM_CMUPD3_Msk instead)  */
#define PWM_CMUPD3_Msk                      (0x2200U)                                      /**< (PWM_CMUPD3) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
#define PWMCMP_NUMBER 8
#define PWMCHNUM_NUMBER 4
/** \brief PWM_CH_NUM hardware registers */
typedef struct {  
  __IO uint32_t PWM_CMR;        /**< (PWM_CH_NUM Offset: 0x00) PWM Channel Mode Register (ch_num = 0) */
  __IO uint32_t PWM_CDTY;       /**< (PWM_CH_NUM Offset: 0x04) PWM Channel Duty Cycle Register (ch_num = 0) */
  __O  uint32_t PWM_CDTYUPD;    /**< (PWM_CH_NUM Offset: 0x08) PWM Channel Duty Cycle Update Register (ch_num = 0) */
  __IO uint32_t PWM_CPRD;       /**< (PWM_CH_NUM Offset: 0x0C) PWM Channel Period Register (ch_num = 0) */
  __O  uint32_t PWM_CPRDUPD;    /**< (PWM_CH_NUM Offset: 0x10) PWM Channel Period Update Register (ch_num = 0) */
  __I  uint32_t PWM_CCNT;       /**< (PWM_CH_NUM Offset: 0x14) PWM Channel Counter Register (ch_num = 0) */
  __IO uint32_t PWM_DT;         /**< (PWM_CH_NUM Offset: 0x18) PWM Channel Dead Time Register (ch_num = 0) */
  __O  uint32_t PWM_DTUPD;      /**< (PWM_CH_NUM Offset: 0x1C) PWM Channel Dead Time Update Register (ch_num = 0) */
} PwmChNum;

/** \brief PWM_CMP hardware registers */
typedef struct {  
  __IO uint32_t PWM_CMPV;       /**< (PWM_CMP Offset: 0x00) PWM Comparison 0 Value Register */
  __O  uint32_t PWM_CMPVUPD;    /**< (PWM_CMP Offset: 0x04) PWM Comparison 0 Value Update Register */
  __IO uint32_t PWM_CMPM;       /**< (PWM_CMP Offset: 0x08) PWM Comparison 0 Mode Register */
  __O  uint32_t PWM_CMPMUPD;    /**< (PWM_CMP Offset: 0x0C) PWM Comparison 0 Mode Update Register */
} PwmCmp;

