aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pwm.h
/** \brief PWM hardware registers */
typedef struct {  
  __IO uint32_t PWM_CLK;        /**< (PWM Offset: 0x00) PWM Clock Register */
  __O  uint32_t PWM_ENA;        /**< (PWM Offset: 0x04) PWM Enable Register */
  __O  uint32_t PWM_DIS;        /**< (PWM Offset: 0x08) PWM Disable Register */
  __I  uint32_t PWM_SR;         /**< (PWM Offset: 0x0C) PWM Status Register */
  __O  uint32_t PWM_IER1;       /**< (PWM Offset: 0x10) PWM Interrupt Enable Register 1 */
  __O  uint32_t PWM_IDR1;       /**< (PWM Offset: 0x14) PWM Interrupt Disable Register 1 */
  __I  uint32_t PWM_IMR1;       /**< (PWM Offset: 0x18) PWM Interrupt Mask Register 1 */
  __I  uint32_t PWM_ISR1;       /**< (PWM Offset: 0x1C) PWM Interrupt Status Register 1 */
  __IO uint32_t PWM_SCM;        /**< (PWM Offset: 0x20) PWM Sync Channels Mode Register */
  __O  uint32_t PWM_DMAR;       /**< (PWM Offset: 0x24) PWM DMA Register */
  __IO uint32_t PWM_SCUC;       /**< (PWM Offset: 0x28) PWM Sync Channels Update Control Register */
  __IO uint32_t PWM_SCUP;       /**< (PWM Offset: 0x2C) PWM Sync Channels Update Period Register */
  __O  uint32_t PWM_SCUPUPD;    /**< (PWM Offset: 0x30) PWM Sync Channels Update Period Update Register */
  __O  uint32_t PWM_IER2;       /**< (PWM Offset: 0x34) PWM Interrupt Enable Register 2 */
  __O  uint32_t PWM_IDR2;       /**< (PWM Offset: 0x38) PWM Interrupt Disable Register 2 */
  __I  uint32_t PWM_IMR2;       /**< (PWM Offset: 0x3C) PWM Interrupt Mask Register 2 */
  __I  uint32_t PWM_ISR2;       /**< (PWM Offset: 0x40) PWM Interrupt Status Register 2 */
  __IO uint32_t PWM_OOV;        /**< (PWM Offset: 0x44) PWM Output Override Value Register */
  __IO uint32_t PWM_OS;         /**< (PWM Offset: 0x48) PWM Output Selection Register */
  __O  uint32_t PWM_OSS;        /**< (PWM Offset: 0x4C) PWM Output Selection Set Register */
  __O  uint32_t PWM_OSC;        /**< (PWM Offset: 0x50) PWM Output Selection Clear Register */
  __O  uint32_t PWM_OSSUPD;     /**< (PWM Offset: 0x54) PWM Output Selection Set Update Register */
  __O  uint32_t PWM_OSCUPD;     /**< (PWM Offset: 0x58) PWM Output Selection Clear Update Register */
  __IO uint32_t PWM_FMR;        /**< (PWM Offset: 0x5C) PWM Fault Mode Register */
  __I  uint32_t PWM_FSR;        /**< (PWM Offset: 0x60) PWM Fault Status Register */
  __O  uint32_t PWM_FCR;        /**< (PWM Offset: 0x64) PWM Fault Clear Register */
  __IO uint32_t PWM_FPV1;       /**< (PWM Offset: 0x68) PWM Fault Protection Value Register 1 */
  __IO uint32_t PWM_FPE;        /**< (PWM Offset: 0x6C) PWM Fault Protection Enable Register */
  __I  uint32_t Reserved1[3];
  __IO uint32_t PWM_ELMR[2];    /**< (PWM Offset: 0x7C) PWM Event Line 0 Mode Register 0 */
  __I  uint32_t Reserved2[7];
  __IO uint32_t PWM_SSPR;       /**< (PWM Offset: 0xA0) PWM Spread Spectrum Register */
  __O  uint32_t PWM_SSPUP;      /**< (PWM Offset: 0xA4) PWM Spread Spectrum Update Register */
  __I  uint32_t Reserved3[2];
  __IO uint32_t PWM_SMMR;       /**< (PWM Offset: 0xB0) PWM Stepper Motor Mode Register */
  __I  uint32_t Reserved4[3];
  __IO uint32_t PWM_FPV2;       /**< (PWM Offset: 0xC0) PWM Fault Protection Value 2 Register */
  __I  uint32_t Reserved5[8];
  __O  uint32_t PWM_WPCR;       /**< (PWM Offset: 0xE4) PWM Write Protection Control Register */
  __I  uint32_t PWM_WPSR;       /**< (PWM Offset: 0xE8) PWM Write Protection Status Register */
  __I  uint32_t Reserved6[17];
       PwmCmp   PWM_CMP[PWMCMP_NUMBER]; /**< Offset: 0x130 PWM Comparison 0 Value Register */
  __I  uint32_t Reserved7[20];
       PwmChNum PWM_CH_NUM[PWMCHNUM_NUMBER]; /**< Offset: 0x200 PWM Channel Mode Register (ch_num = 0) */
  __I  uint32_t Reserved8[96];
  __O  uint32_t PWM_CMUPD0;     /**< (PWM Offset: 0x400) PWM Channel Mode Update Register (ch_num = 0) */
  __I  uint32_t Reserved9[7];
  __O  uint32_t PWM_CMUPD1;     /**< (PWM Offset: 0x420) PWM Channel Mode Update Register (ch_num = 1) */
  __I  uint32_t Reserved10[2];
  __IO uint32_t PWM_ETRG1;      /**< (PWM Offset: 0x42C) PWM External Trigger Register (trg_num = 1) */
  __IO uint32_t PWM_LEBR1;      /**< (PWM Offset: 0x430) PWM Leading-Edge Blanking Register (trg_num = 1) */
  __I  uint32_t Reserved11[3];
  __O  uint32_t PWM_CMUPD2;     /**< (PWM Offset: 0x440) PWM Channel Mode Update Register (ch_num = 2) */
  __I  uint32_t Reserved12[2];
  __IO uint32_t PWM_ETRG2;      /**< (PWM Offset: 0x44C) PWM External Trigger Register (trg_num = 2) */
  __IO uint32_t PWM_LEBR2;      /**< (PWM Offset: 0x450) PWM Leading-Edge Blanking Register (trg_num = 2) */
  __I  uint32_t Reserved13[3];
  __O  uint32_t PWM_CMUPD3;     /**< (PWM Offset: 0x460) PWM Channel Mode Update Register (ch_num = 3) */
} Pwm;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief PWM_CH_NUM hardware registers */
typedef struct {  
  __IO PWM_CMR_Type                   PWM_CMR;        /**< Offset: 0x00 (R/W  32) PWM Channel Mode Register (ch_num = 0) */
  __IO PWM_CDTY_Type                  PWM_CDTY;       /**< Offset: 0x04 (R/W  32) PWM Channel Duty Cycle Register (ch_num = 0) */
  __O  PWM_CDTYUPD_Type               PWM_CDTYUPD;    /**< Offset: 0x08 ( /W  32) PWM Channel Duty Cycle Update Register (ch_num = 0) */
  __IO PWM_CPRD_Type                  PWM_CPRD;       /**< Offset: 0x0C (R/W  32) PWM Channel Period Register (ch_num = 0) */
  __O  PWM_CPRDUPD_Type               PWM_CPRDUPD;    /**< Offset: 0x10 ( /W  32) PWM Channel Period Update Register (ch_num = 0) */
  __I  PWM_CCNT_Type                  PWM_CCNT;       /**< Offset: 0x14 (R/   32) PWM Channel Counter Register (ch_num = 0) */
  __IO PWM_DT_Type                    PWM_DT;         /**< Offset: 0x18 (R/W  32) PWM Channel Dead Time Register (ch_num = 0) */
  __O  PWM_DTUPD_Type                 PWM_DTUPD;      /**< Offset: 0x1C ( /W  32) PWM Channel Dead Time Update Register (ch_num = 0) */
} PwmChNum;

/** \brief PWM_CMP hardware registers */
typedef struct {  
  __IO PWM_CMPV_Type                  PWM_CMPV;       /**< Offset: 0x00 (R/W  32) PWM Comparison 0 Value Register */
  __O  PWM_CMPVUPD_Type               PWM_CMPVUPD;    /**< Offset: 0x04 ( /W  32) PWM Comparison 0 Value Update Register */
  __IO PWM_CMPM_Type                  PWM_CMPM;       /**< Offset: 0x08 (R/W  32) PWM Comparison 0 Mode Register */
  __O  PWM_CMPMUPD_Type               PWM_CMPMUPD;    /**< Offset: 0x0C ( /W  32) PWM Comparison 0 Mode Update Register */
} PwmCmp;

