aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pwm.h
/** \brief PWM hardware registers */
typedef struct {  
  __IO PWM_CLK_Type                   PWM_CLK;        /**< Offset: 0x00 (R/W  32) PWM Clock Register */
  __O  PWM_ENA_Type                   PWM_ENA;        /**< Offset: 0x04 ( /W  32) PWM Enable Register */
  __O  PWM_DIS_Type                   PWM_DIS;        /**< Offset: 0x08 ( /W  32) PWM Disable Register */
  __I  PWM_SR_Type                    PWM_SR;         /**< Offset: 0x0C (R/   32) PWM Status Register */
  __O  PWM_IER1_Type                  PWM_IER1;       /**< Offset: 0x10 ( /W  32) PWM Interrupt Enable Register 1 */
  __O  PWM_IDR1_Type                  PWM_IDR1;       /**< Offset: 0x14 ( /W  32) PWM Interrupt Disable Register 1 */
  __I  PWM_IMR1_Type                  PWM_IMR1;       /**< Offset: 0x18 (R/   32) PWM Interrupt Mask Register 1 */
  __I  PWM_ISR1_Type                  PWM_ISR1;       /**< Offset: 0x1C (R/   32) PWM Interrupt Status Register 1 */
  __IO PWM_SCM_Type                   PWM_SCM;        /**< Offset: 0x20 (R/W  32) PWM Sync Channels Mode Register */
  __O  PWM_DMAR_Type                  PWM_DMAR;       /**< Offset: 0x24 ( /W  32) PWM DMA Register */
  __IO PWM_SCUC_Type                  PWM_SCUC;       /**< Offset: 0x28 (R/W  32) PWM Sync Channels Update Control Register */
  __IO PWM_SCUP_Type                  PWM_SCUP;       /**< Offset: 0x2C (R/W  32) PWM Sync Channels Update Period Register */
  __O  PWM_SCUPUPD_Type               PWM_SCUPUPD;    /**< Offset: 0x30 ( /W  32) PWM Sync Channels Update Period Update Register */
  __O  PWM_IER2_Type                  PWM_IER2;       /**< Offset: 0x34 ( /W  32) PWM Interrupt Enable Register 2 */
  __O  PWM_IDR2_Type                  PWM_IDR2;       /**< Offset: 0x38 ( /W  32) PWM Interrupt Disable Register 2 */
  __I  PWM_IMR2_Type                  PWM_IMR2;       /**< Offset: 0x3C (R/   32) PWM Interrupt Mask Register 2 */
  __I  PWM_ISR2_Type                  PWM_ISR2;       /**< Offset: 0x40 (R/   32) PWM Interrupt Status Register 2 */
  __IO PWM_OOV_Type                   PWM_OOV;        /**< Offset: 0x44 (R/W  32) PWM Output Override Value Register */
  __IO PWM_OS_Type                    PWM_OS;         /**< Offset: 0x48 (R/W  32) PWM Output Selection Register */
  __O  PWM_OSS_Type                   PWM_OSS;        /**< Offset: 0x4C ( /W  32) PWM Output Selection Set Register */
  __O  PWM_OSC_Type                   PWM_OSC;        /**< Offset: 0x50 ( /W  32) PWM Output Selection Clear Register */
  __O  PWM_OSSUPD_Type                PWM_OSSUPD;     /**< Offset: 0x54 ( /W  32) PWM Output Selection Set Update Register */
  __O  PWM_OSCUPD_Type                PWM_OSCUPD;     /**< Offset: 0x58 ( /W  32) PWM Output Selection Clear Update Register */
  __IO PWM_FMR_Type                   PWM_FMR;        /**< Offset: 0x5C (R/W  32) PWM Fault Mode Register */
  __I  PWM_FSR_Type                   PWM_FSR;        /**< Offset: 0x60 (R/   32) PWM Fault Status Register */
  __O  PWM_FCR_Type                   PWM_FCR;        /**< Offset: 0x64 ( /W  32) PWM Fault Clear Register */
  __IO PWM_FPV1_Type                  PWM_FPV1;       /**< Offset: 0x68 (R/W  32) PWM Fault Protection Value Register 1 */
  __IO PWM_FPE_Type                   PWM_FPE;        /**< Offset: 0x6C (R/W  32) PWM Fault Protection Enable Register */
       RoReg8                         Reserved1[0xC];
  __IO PWM_ELMR_Type                  PWM_ELMR[2];    /**< Offset: 0x7C (R/W  32) PWM Event Line 0 Mode Register 0 */
       RoReg8                         Reserved2[0x1C];
  __IO PWM_SSPR_Type                  PWM_SSPR;       /**< Offset: 0xA0 (R/W  32) PWM Spread Spectrum Register */
  __O  PWM_SSPUP_Type                 PWM_SSPUP;      /**< Offset: 0xA4 ( /W  32) PWM Spread Spectrum Update Register */
       RoReg8                         Reserved3[0x8];
  __IO PWM_SMMR_Type                  PWM_SMMR;       /**< Offset: 0xB0 (R/W  32) PWM Stepper Motor Mode Register */
       RoReg8                         Reserved4[0xC];
  __IO PWM_FPV2_Type                  PWM_FPV2;       /**< Offset: 0xC0 (R/W  32) PWM Fault Protection Value 2 Register */
       RoReg8                         Reserved5[0x20];
  __O  PWM_WPCR_Type                  PWM_WPCR;       /**< Offset: 0xE4 ( /W  32) PWM Write Protection Control Register */
  __I  PWM_WPSR_Type                  PWM_WPSR;       /**< Offset: 0xE8 (R/   32) PWM Write Protection Status Register */
       RoReg8                         Reserved6[0x44];
       PwmCmp                         PWM_CMP[8];     /**< Offset: 0x130 PWM Comparison 0 Value Register */
       RoReg8                         Reserved7[0x50];
       PwmChNum                       PWM_CH_NUM[4];  /**< Offset: 0x200 PWM Channel Mode Register (ch_num = 0) */
       RoReg8                         Reserved8[0x180];
  __O  PWM_CMUPD0_Type                PWM_CMUPD0;     /**< Offset: 0x400 ( /W  32) PWM Channel Mode Update Register (ch_num = 0) */
       RoReg8                         Reserved9[0x1C];
  __O  PWM_CMUPD1_Type                PWM_CMUPD1;     /**< Offset: 0x420 ( /W  32) PWM Channel Mode Update Register (ch_num = 1) */
       RoReg8                         Reserved10[0x8];
  __IO PWM_ETRG1_Type                 PWM_ETRG1;      /**< Offset: 0x42C (R/W  32) PWM External Trigger Register (trg_num = 1) */
  __IO PWM_LEBR1_Type                 PWM_LEBR1;      /**< Offset: 0x430 (R/W  32) PWM Leading-Edge Blanking Register (trg_num = 1) */
       RoReg8                         Reserved11[0xC];
  __O  PWM_CMUPD2_Type                PWM_CMUPD2;     /**< Offset: 0x440 ( /W  32) PWM Channel Mode Update Register (ch_num = 2) */
       RoReg8                         Reserved12[0x8];
  __IO PWM_ETRG2_Type                 PWM_ETRG2;      /**< Offset: 0x44C (R/W  32) PWM External Trigger Register (trg_num = 2) */
  __IO PWM_LEBR2_Type                 PWM_LEBR2;      /**< Offset: 0x450 (R/W  32) PWM Leading-Edge Blanking Register (trg_num = 2) */
       RoReg8                         Reserved13[0xC];
  __O  PWM_CMUPD3_Type                PWM_CMUPD3;     /**< Offset: 0x460 ( /W  32) PWM Channel Mode Update Register (ch_num = 3) */
} Pwm;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/** @}  end of Pulse Width Modulation Controller */

#endif /* _SAME70_PWM_COMPONENT_H_ */
